# Viewport View Position Property

Source: https://www.revitapidocs.com/2026/f2290e83-ac72-44e1-a8a2-44cc290dcc42.htm

---

| Viewport View Position Property |
| --- |

Specifies view's position. Default is set to XYZ.Zero.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public XYZ ViewPosition { get; }
```

```
Public ReadOnly Property ViewPosition As XYZ
	Get
```

```
public:
property XYZ^ ViewPosition {
	XYZ^ get ();
}
```

```
member ViewPosition : XYZ with get
```

#### Property Value

XYZ See Also

#### Reference

Viewport Class Autodesk.Revit.DB Namespace